In [90]:
import pandas as pd
import numpy as np

In [91]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [92]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [93]:
df[df.FlightNumber.isnull()].index.tolist()

[1, 3]

In [94]:
def adding_flightnumber():
  for i in df[df.FlightNumber.isnull()].index.tolist():
    df.FlightNumber.loc[i]= df.FlightNumber.loc[i-1]+10

In [95]:
adding_flightnumber()

C:\Users\vishal sangwan\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [96]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [97]:
first,second =[],[]
for i in df.From_To:
  f,s = i.split("_")
  first.append(f)
  second.append(s)

In [98]:
first

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [99]:
second

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [100]:
df.From_To = pd.Series(first)
df["To"] = pd.Series(second)

In [101]:
df.head()

               Airline  FlightNumber   From_To  RecentDelays         To
0               KLM(!)       10045.0    LoNDon      [23, 47]      paris
1    <Air France> (12)       10055.0    MAdrid            []      miLAN
2  (British Airways. )       10065.0    londON  [24, 43, 87]  StockhOlm
3       12. Air France       10075.0  Budapest          [13]      PaRis
4          "Swiss Air"       10085.0  Brussels      [67, 32]     londOn

### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [102]:
df.From_To.replace(to_replace=df.From_To.tolist() ,value=[i.title() for i in df.From_To ], inplace=True)

In [103]:
df.To.replace(to_replace=df.To.tolist() ,value=[i.title() for i in df.To ], inplace = True)

In [104]:
df.head()

               Airline  FlightNumber   From_To  RecentDelays         To
0               KLM(!)       10045.0    London      [23, 47]      Paris
1    <Air France> (12)       10055.0    Madrid            []      Milan
2  (British Airways. )       10065.0    London  [24, 43, 87]  Stockholm
3       12. Air France       10075.0  Budapest          [13]      Paris
4          "Swiss Air"       10085.0  Brussels      [67, 32]     London

### Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

already_done

In [105]:
df.head()

               Airline  FlightNumber   From_To  RecentDelays         To
0               KLM(!)       10045.0    London      [23, 47]      Paris
1    <Air France> (12)       10055.0    Madrid            []      Milan
2  (British Airways. )       10065.0    London  [24, 43, 87]  Stockholm
3       12. Air France       10075.0  Budapest          [13]      Paris
4          "Swiss Air"       10085.0  Brussels      [67, 32]     London

### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [114]:
df.head()

               Airline  FlightNumber   From_To  RecentDelays         To
0               KLM(!)       10045.0    London      [23, 47]      Paris
1    <Air France> (12)       10055.0    Madrid            []      Milan
2  (British Airways. )       10065.0    London  [24, 43, 87]  Stockholm
3       12. Air France       10075.0  Budapest          [13]      Paris
4          "Swiss Air"       10085.0  Brussels      [67, 32]     London

In [106]:
max_no = 0
for i in df.RecentDelays:
    a = len(i)
    if  max_no < a:
        max_no = a

In [107]:
max_no

3

In [108]:
delay_1,delay_2,delay_3 = [], [],[]

In [109]:
for j in df.RecentDelays:
    if len(j) == 0:
        delay_1.append(None)
        delay_2.append(None)
        delay_3.append(None)
    elif len(j)==1:
        delay_1.append(j[0])
        delay_2.append(None)
        delay_3.append(None)
    elif len(j)==2:
        delay_1.append(j[0])
        delay_2.append(j[1])
        delay_3.append(None)
    else:
        delay_1.append(j[0])
        delay_2.append(j[1])
        delay_3.append(j[2])

### Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [117]:
df["delay_1"] = delay_1
df["delay_2"] = delay_2
df["delay_3"] = delay_3

In [118]:
df.head()

,Airline,FlightNumber,From_To,RecentDelays,To,delay_1,delay_2,delay_3
0,KLM(!),10045.0,London,"[23, 47]",Paris,23.0,47.0,NaN
1,<Air France> (12),10055.0,Madrid,[],Milan,NaN,NaN,NaN
2,(British Airways. ),10065.0,London,"[24, 43, 87]",Stockholm,24.0,43.0,87.0
3,12. Air France,10075.0,Budapest,[13],Paris,13.0,NaN,NaN
4,"""Swiss Air""",10085.0,Brussels,"[67, 32]",London,67.0,32.0,NaN

In [119]:
df.drop(columns = ["RecentDelays"], inplace = True)

In [120]:
df.head()

,Airline,FlightNumber,From_To,To,delay_1,delay_2,delay_3
0,KLM(!),10045.0,London,Paris,23.0,47.0,NaN
1,<Air France> (12),10055.0,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065.0,London,Stockholm,24.0,43.0,87.0
3,12. Air France,10075.0,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",10085.0,Brussels,London,67.0,32.0,NaN